In [84]:
import numpy as np
import pandas as pd
import matplotlib.pyplot as plt

In [85]:
data=pd.read_csv("Train.csv")

In [86]:
data.head()

,pclass,survived,name,sex,age,sibsp,parch,ticket,fare,cabin,embarked,boat,body,home.dest
0,3.0,0.0,"O'Donoghue, Ms. Bridget",female,NaN,0.0,0.0,364856,7.750,NaN,Q,NaN,NaN,NaN
1,2.0,0.0,"Morley, Mr. Henry Samuel (""Mr Henry Marshall"")",male,39.0,0.0,0.0,250655,26.000,NaN,S,NaN,NaN,NaN
2,2.0,1.0,"Smith, Miss. Marion Elsie",female,40.0,0.0,0.0,31418,13.000,NaN,S,9,NaN,NaN
3,3.0,1.0,"Goldsmith, Mrs. Frank John (Emily Alice Brown)",female,31.0,1.0,1.0,363291,20.525,NaN,S,C D,NaN,"Strood, Kent, England Detroit, MI"
4,3.0,1.0,"McCoy, Miss. Agnes",female,NaN,2.0,0.0,367226,23.250,NaN,Q,16,NaN,NaN

In [87]:
data.shape

(1009, 14)

In [88]:
data.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 1009 entries, 0 to 1008
Data columns (total 14 columns):
 #   Column     Non-Null Count  Dtype
---  ------     --------------  -----
 0   pclass     1009 non-null   float64
 1   survived   1009 non-null   float64
 2   name       1009 non-null   object
 3   sex        1009 non-null   object
 4   age        812 non-null    float64
 5   sibsp      1009 non-null   float64
 6   parch      1009 non-null   float64
 7   ticket     1009 non-null   object
 8   fare       1008 non-null   float64
 9   cabin      229 non-null    object
 10  embarked   1008 non-null   object
 11  boat       374 non-null    object
 12  body       98 non-null     float64
 13  home.dest  582 non-null    object
dtypes: float64(7), object(7)
memory usage: 110.5+ KB

In [89]:
data.columns

Index(['pclass', 'survived', 'name', 'sex', 'age', 'sibsp', 'parch', 'ticket',
       'fare', 'cabin', 'embarked', 'boat', 'body', 'home.dest'],
      dtype='object')

In [90]:
columns_to_drop=[ 'name','ticket','cabin', 'embarked', 'boat', 'body', 'home.dest']

In [91]:
data_clean=data.drop(columns=columns_to_drop)

In [92]:
data_clean

      pclass  survived     sex   age  sibsp  parch      fare
0        3.0       0.0  female   NaN    0.0    0.0    7.7500
1        2.0       0.0    male  39.0    0.0    0.0   26.0000
2        2.0       1.0  female  40.0    0.0    0.0   13.0000
3        3.0       1.0  female  31.0    1.0    1.0   20.5250
4        3.0       1.0  female   NaN    2.0    0.0   23.2500
...      ...       ...     ...   ...    ...    ...       ...
1004     1.0       1.0    male  40.0    0.0    0.0   31.0000
1005     3.0       0.0  female  37.0    0.0    0.0    9.5875
1006     1.0       1.0  female  23.0    1.0    0.0  113.2750
1007     3.0       1.0    male  12.0    1.0    0.0   11.2417
1008     3.0       0.0    male  30.0    0.0    0.0    8.0500

[1009 rows x 7 columns]

In [93]:
from sklearn.preprocessing import LabelEncoder

In [94]:
le=LabelEncoder()

In [95]:
data_clean['sex']

0       female
1         male
2       female
3       female
4       female
         ...
1004      male
1005    female
1006    female
1007      male
1008      male
Name: sex, Length: 1009, dtype: object

In [96]:
le.fit_transform(data_clean['sex'])

array([0, 1, 0, ..., 0, 1, 1])

In [97]:
data_clean['sex']

0       female
1         male
2       female
3       female
4       female
         ...
1004      male
1005    female
1006    female
1007      male
1008      male
Name: sex, Length: 1009, dtype: object

In [98]:
data_clean['sex']=le.fit_transform(data_clean['sex'])

In [99]:
data_clean

      pclass  survived  sex   age  sibsp  parch      fare
0        3.0       0.0    0   NaN    0.0    0.0    7.7500
1        2.0       0.0    1  39.0    0.0    0.0   26.0000
2        2.0       1.0    0  40.0    0.0    0.0   13.0000
3        3.0       1.0    0  31.0    1.0    1.0   20.5250
4        3.0       1.0    0   NaN    2.0    0.0   23.2500
...      ...       ...  ...   ...    ...    ...       ...
1004     1.0       1.0    1  40.0    0.0    0.0   31.0000
1005     3.0       0.0    0  37.0    0.0    0.0    9.5875
1006     1.0       1.0    0  23.0    1.0    0.0  113.2750
1007     3.0       1.0    1  12.0    1.0    0.0   11.2417
1008     3.0       0.0    1  30.0    0.0    0.0    8.0500

[1009 rows x 7 columns]

In [100]:
data_clean.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 1009 entries, 0 to 1008
Data columns (total 7 columns):
 #   Column    Non-Null Count  Dtype
---  ------    --------------  -----
 0   pclass    1009 non-null   float64
 1   survived  1009 non-null   float64
 2   sex       1009 non-null   int32
 3   age       812 non-null    float64
 4   sibsp     1009 non-null   float64
 5   parch     1009 non-null   float64
 6   fare      1008 non-null   float64
dtypes: float64(6), int32(1)
memory usage: 51.4 KB

In [101]:
data_clean["age"].median()

28.0

In [102]:
data_clean["fare"].median()

14.4583

In [103]:
data_clean["age"]=data_clean["age"].fillna(value=data_clean["age"].median())

In [104]:
data_clean["fare"]=data_clean["fare"].fillna(value=data_clean["fare"].median())

In [105]:
data_clean.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 1009 entries, 0 to 1008
Data columns (total 7 columns):
 #   Column    Non-Null Count  Dtype
---  ------    --------------  -----
 0   pclass    1009 non-null   float64
 1   survived  1009 non-null   float64
 2   sex       1009 non-null   int32
 3   age       1009 non-null   float64
 4   sibsp     1009 non-null   float64
 5   parch     1009 non-null   float64
 6   fare      1009 non-null   float64
dtypes: float64(6), int32(1)
memory usage: 51.4 KB

In [106]:
data_clean.columns

Index(['pclass', 'survived', 'sex', 'age', 'sibsp', 'parch', 'fare'], dtype='object')

In [107]:
input_cols=['pclass', 'sex', 'age', 'sibsp', 'parch', 'fare']

In [108]:
output_cols=['survived']

In [109]:
X=data_clean[input_cols]

In [110]:
y=data_clean[output_cols]

In [111]:
X.columns

Index(['pclass', 'sex', 'age', 'sibsp', 'parch', 'fare'], dtype='object')

In [112]:
from sklearn.tree import DecisionTreeClassifier, DecisionTreeRegressor

In [119]:
model = DecisionTreeClassifier(max_depth=5, )

In [120]:
model.fit(X,y)

DecisionTreeClassifier(max_depth=5)

In [121]:
model.score(X,y)

0.8285431119920713

In [122]:
data1=pd.read_csv("Test.csv")

In [123]:
data1.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 300 entries, 0 to 299
Data columns (total 13 columns):
 #   Column     Non-Null Count  Dtype
---  ------     --------------  -----
 0   pclass     300 non-null    float64
 1   name       300 non-null    object
 2   sex        300 non-null    object
 3   age        234 non-null    float64
 4   sibsp      300 non-null    float64
 5   parch      300 non-null    float64
 6   ticket     300 non-null    object
 7   fare       300 non-null    float64
 8   cabin      66 non-null     object
 9   embarked   299 non-null    object
 10  boat       112 non-null    object
 11  body       23 non-null     float64
 12  home.dest  163 non-null    object
dtypes: float64(6), object(7)
memory usage: 30.6+ KB

In [124]:
columns_to_drop=[ 'name','ticket','cabin', 'embarked', 'boat', 'body', 'home.dest']

In [125]:
data_clean1=data1.drop(columns=columns_to_drop)

In [126]:
data_clean1['sex']=le.fit_transform(data_clean1['sex'])

In [127]:
data_clean1

     pclass  sex   age  sibsp  parch     fare
0       1.0    1  36.0    0.0    0.0  26.3875
1       3.0    0   NaN    8.0    2.0  69.5500
2       1.0    1   NaN    0.0    0.0  50.0000
3       2.0    1  34.0    0.0    0.0  13.0000
4       2.0    1  28.0    0.0    0.0  13.0000
..      ...  ...   ...    ...    ...      ...
295     3.0    0  29.0    0.0    0.0   7.9250
296     1.0    0  39.0    1.0    1.0  83.1583
297     3.0    1  13.0    4.0    2.0  31.3875
298     3.0    1   NaN    2.0    0.0  21.6792
299     3.0    0   NaN    0.0    0.0   7.7500

[300 rows x 6 columns]

In [128]:
data_clean1["age"]=data_clean1["age"].fillna(value=data_clean1["age"].median())

In [129]:
data_clean1["fare"]=data_clean1["fare"].fillna(value=data_clean1["fare"].median())

In [130]:
data_clean1.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 300 entries, 0 to 299
Data columns (total 6 columns):
 #   Column  Non-Null Count  Dtype
---  ------  --------------  -----
 0   pclass  300 non-null    float64
 1   sex     300 non-null    int32
 2   age     300 non-null    float64
 3   sibsp   300 non-null    float64
 4   parch   300 non-null    float64
 5   fare    300 non-null    float64
dtypes: float64(5), int32(1)
memory usage: 13.0 KB

In [131]:
input_cols=['pclass', 'sex', 'age', 'sibsp', 'parch', 'fare']

In [132]:
X1=data_clean1[input_cols]

In [133]:
model.predict(X)

array([1., 0., 1., ..., 1., 0., 0.])

In [134]:
df=pd.DataFrame(data=model.predict(X1),columns=["survived"])

In [135]:
df

     survived
0         0.0
1         0.0
2         0.0
3         0.0
4         0.0
..        ...
295       0.0
296       1.0
297       0.0
298       0.0
299       1.0

[300 rows x 1 columns]

In [136]:
df.index.names = ['Id']

In [137]:
df

     survived
Id
0         0.0
1         0.0
2         0.0
3         0.0
4         0.0
..        ...
295       0.0
296       1.0
297       0.0
298       0.0
299       1.0

[300 rows x 1 columns]

In [138]:
df.to_csv("Titanic_Survive.csv")